BX.ready(() => {
    BX.loggingLists = {
        places: {
            0: 'встройка Фильтры',
            1: 'поиск каталога товаров',
            2: 'грид каталога товаров',
            3: 'шапка сайта',
            4: 'каталог товаров',
            5: 'рабочий стол',
            6: 'виджеты рабочего стола',
            7: 'профиль пользователя',
            8: 'стартовое модальное окно подсказок',
            9: 'список вебинаров',
            10: 'виджет мероприятий',
            11: 'шапка каталога',
            12: 'левое меню',
            13: 'видео подсказки',
            14: 'попап',
            15: 'иконка акций в товаре',
            16: 'страница Корзина',
            17: 'встройка регистрации в партнерской программе',
            18: 'раздел Пресейл',
            19: 'выбор склада в каталоге',
            20: 'список привилегий партнера',
            21: 'баннеры на главной',
        },

        events: {
            0: 'развернул список разделов',
            1: 'свернул список разделов',
            2: 'перешел в раздел',
            3: 'развернул свойство',
            4: 'свернул свойство',
            5: 'изменил значение фильтра',
            6: 'посмотрел все значения фильтра',
            7: 'применил фильтр',
            8: 'сбросил фильтр',
            9: 'изменил значение строки поиска',
            10: 'выполнил сортировку',
            11: 'открыл панель аналоги',
            12: 'открыл панель сопутствующие товары',
            13: 'перешел в профиль',
            14: 'перешел на страницу загрузки товаров',
            15: 'перешел на страницу заказов',
            16: 'нажал на Скачать файл',
            17: 'просмотрел код активации сертификата',
            18: 'начал курс подсказок',
            19: 'отказался от курса подсказок',
            20: 'таймстамп видео',
            21: 'вызвал маленький календарь',
            22: 'прокрутил даты',
            23: 'выбрал дату',
            24: 'выбрал диапазон дат',
            25: 'очистил диапазон дат',
            26: 'перешел на страницу мероприятия',
            27: 'нажал на Выполнить скачивание файла',
            28: 'прокрутка фильтра',
            29: 'убрал из избранного',
            30: 'добавил в избранное',
            31: 'нажал на контакты менеджера',
            32: 'нажал на кнопку Запрос на закупку',
            33: 'оценил пользу от видео',
            34: 'закрытие попапа',
            35: 'переход по ссылке из письма',
            36: 'показ рекомендаций',
            37: 'открыта карточка рекомендации',
            38: 'рекомендация добавлена в корзину',
            39: 'вызов описания акции',
            40: 'вызов описания всех акций',
            41: 'отображение корзины в каталоге',
            42: 'попадание блока с рекомендациями на экран пользователя',
            43: 'открытие альтернатив к товару',
            44: 'закрытие альтернатив к товару',
            45: 'замена товара на альтернативу',
            46: 'сформировал коммерческое предложение',
            47: 'переход в раздел Пресейл',
            48: 'отправка заявки',
            49: 'открытие',
            50: 'отправка формы',
            51: 'закрытие попапа',
            52: 'изменение отображаемых складов',
            53: 'переход в раздел Привилегии партнера',
            54: 'переход в раздел Бонусная программа',
            55: 'клик по привилегии',
            56: 'клик по иконке партнерской программы',
            57: 'удаление товара добавленного из альтернатив',
            58: 'восстановление товара добавленного из альтернатив',
            59: 'клик по баннеру',
        }
    }
});

function clickstream(event, place, eventAdd = '', placeAdd = '', date = '') {
    if (!event || !place) {
        return false;
    }

    if (BX.getCookie('SHOW_LOGS')) {
        console.group('Logs');
        console.log(`EVENT: ${event}`);
        console.log(`EVENT_ADDITIONALLY: ${eventAdd}`);
        console.log(`PLACE: ${place}`);
        console.log(`PLACE_ADDITIONALLY: ${placeAdd}`);
        console.log(`DATE_TIME: ${date}`);
        console.groupEnd();
    }

    BX.ajax.runComponentAction(
        'dssl:clickstream',
        'send',
        {
            mode: 'class',
            data: {
                data: {
                    EVENT: event,
                    EVENT_ADDITIONALLY: eventAdd,
                    PLACE: place,
                    PLACE_ADDITIONALLY: placeAdd,
                    DATE_TIME: date,
                }
            }
        }
    ).then(response => {
        //console.log(response);
    });
}

function checkUrl(param, event, place = '-', eventAdd = '', placeAdd = '') {
    const cookieName = `${BX.message('COOKIE_PREFIX')}_${param.toLocaleUpperCase()}_CLICKSTREAM`;
    const params = new URLSearchParams(location.search);

    if (BX.getCookie(cookieName)) {
        clickstream(event, place, `${BX.getCookie(cookieName)} ${eventAdd}`, placeAdd);

        if (params.has(param)) {
            params.delete(param);

            const url = new URL(location.href);
            url.search = `?${params.toLocaleString()}`;
    
            history.replaceState({}, '', url.href);
        }

        BX.setCookie(cookieName, false, { path: '/', expires: -1, domain: `.${location.host}` });
    }
}
